namespace FingerPrintClient.FP.Utilities;

internal class FPErrors
{
    public const string DEVICE_NOT_FOUND = "لم يتم التعرف على جهاز البصمة ...";
    public const string FP_GENERAL_ERROR = "خطأ أثناء المعالجة ...";
    public const string FP_ALREADY_EXISTS = "البصمة موجودة من قبل ... !!!";
    public const string FP_NOT_FOUND = "البصمة غير موجودة من قبل ... !!!";

    public static string GetCodeText(int errCode)
    {
        string message = errCode switch
        {
            -25 => "الجهاز متصل مسبقا",
            -24 => "لم يتمكن من تهيئة الجهاز",
            -23 => "لم يتمكن من تشغيل الجهاز",
            -22 => "فشل دمج البصمات المسجلة.",
            -20 => "فشلت مقارنة البصمة",
            -18 => "فشل التقاط البصمة",
            -17 => "فشلت العملية",
            -14 => "فشل حذف كود البصمة من الذاكرة",
            -13 => "فشل إضافة كود البصمة للذاكرة",
            -12 => "يتم التقاط البصمة",
            -11 => "ذاكرة غير كافية",
            -10 => "تم إجهاض العملية",
            -9 => "فشل استخراج كود البصمة",
            -8 => "فشل التقاط صورة البصمة",
            -7 => "مقبض الذاكرة غير صحيح",
            -6 => "فشل بدء تشغيل الجهاز",
            -5 => "وسيط غير صحيح",
            -4 => "غير مدعوم في الواجهة ",
            -3 => "لا يوجد جهاز متصل",
            -2 => "فشلت تهيئة مكتبة التقاط البصمة",
            -1 => "فشلت تهيئة خوارزمية التقاط البصمة",
            0 => "نجحت العملية",
            1 => "تمت التهيئة",
            _ => "خطأ غير محدد",
        };
        return message;
    }
}
